export const districtWisePsMap = {
    "തിരുവനന്തപുരം": ["തിരുവനന്തപുരം", "നെയ്യാറ്റിൻകര", "വെഞ്ഞാറമൂട്"],
    "കൊല്ലം": ["തലവൂർ", "കൊട്ടാരക്കര"],
    "പത്തനംതിട്ട": ["ഓമല്ലൂർ", "എഴുമറ്റൂർ"],
    "ആലപ്പുഴ": ["ചേർത്തല", "തുറവൂർ", "കൂറ്റുവേലി", "ഹരിപ്പാട്", "കായംകുളം", "മണ്ണഞ്ചേരി"],
    "കോട്ടയം": ["കോട്ടയം", "വൈക്കം"],
    "ഇടുക്കി": ["തൊടുപുഴ"],
    "എറണാകുളം": ["എറണാകുളം", "പെരുമ്പാവൂർ", "ആലുവ", "ചോറ്റാനിക്കര", "തൃപ്പൂണിത്തുറ", "പനങ്ങാട്", "ഇടപ്പള്ളി"],
    "തൃശ്ശൂർ": ["തൃശ്ശൂർ", "വടക്കാഞ്ചേരി", "മുകുന്ദപുരം", "കുന്ദംകുളം", "ഗുരുവായൂർ", "തൃപ്രയാർ", "ചേർപ്പ്"],
    "പാലക്കാട്": ["ഒറ്റപ്പാലം", "പാലക്കാട്", "പട്ടാമ്പി"],
    "മലപ്പുറം": ["മഞ്ചേരി", "പൊന്നാനി", "വണ്ടൂർ", "മലപ്പുറം", "തിരൂർ", "പരപ്പനങ്ങാടി"],
    "കോഴിക്കോട്": ["കൊയിലാണ്ടി", "താമരശ്ശേരി", "വേങ്ങേരി", "ചേവായൂർ", "കക്കോടി", "കോട്ടൂർ", "തൃക്കുറ്റിശ്ശേരി", "വെസ്റ്റ് ഹിൽ", "പേരാമ്പ്ര", "നിട്ടൂർ", "രാമനാട്ടുകര", "പാലക്കോട്"],
    "വയനാട്": ["പനമരം", "മാനന്തവാടി"],
    "കണ്ണൂർ": ["പയ്യന്നൂർ", "ആലപ്പടമ്പ", "അറത്തിൽ", "തലശ്ശേരി", "വടവന്തൂർ", "മട്ടന്നൂർ", "മുഴക്കുന്ന്", "തളിപ്പറമ്പ്"],
    "കാസർഗോഡ്": ["ഹോസ്‌ദുർഗ്", "കാസർഗോഡ്"],
    "Outside Kerala": ["ഹൈദരാബാദ്", "കോയമ്പത്തൂർ", "ചെന്നൈ", "ഈറോഡ്", "ഡൽഹി", "അഹമ്മദാബാദ്", "ബാംഗ്ലൂർ", "ബാന്ദ്ര", "മുംബൈ", "മസ്‌ക്കറ്റ്", "Others"]
}

export const queryCategories = [
    "General",
    "Transporation",
    "Accommodation",
    "Offcial Program",
    "Cultural Program",
    "Souvenir",
    "Contests",
    "Finance",
    "Venue",
    "Food",
    "Advertisement"
];