const _09nov2024 = `
<h4>യുവവേദി മീറ്റിങ് മിനിറ്റ്സ്&nbsp;&nbsp;|&nbsp;&nbsp;09 Nov 2024&nbsp;&nbsp;|&nbsp;&nbsp;08:00 PM</h4>
<p>
എറണാകുളം ജില്ലാ യുവവേദിയുടെ പുതിയ ഭരണസമിതിയുടെ ആദ്യ മീറ്റിംഗ് 2024 നവംബർ 9 തിയതി രാത്രി 8 മണിക്ക് ഓൺലൈൻ ആയി ചേരുകയുണ്ടായി.
</p>
<p>
എറണാകുളം ജില്ലാ യുവവേദി പ്രസിഡൻറ് ശ്രീ അനൂപ് ഉണ്ണി അധ്യക്ഷനായ മീറ്റിംഗ്, പെരുമ്പാവൂർ പ്രാദേശികസഭാംഗം കുമാരി കൃഷ്ണേന്ദുവിന്റെ ഈശ്വര പ്രാർത്ഥനയോടെ തുടങ്ങി. തുടർന്ന് കഴിഞ്ഞ കാലയളവിൽ നമ്മെ വിട്ടു പോയവരുടെ വേർപാടിൽ എറണാകുളം പ്രാദേശിക സഭാംഗം ശ്രീ രോഹിത് രാജ് അനുശോചനം രേഖപ്പെടുത്തി. മീറ്റിംഗിൽ പങ്കെടുത്ത എല്ലാവർക്കും ആലുവ പ്രാദേശിക സഭാംഗം ശ്രീ പ്രിയ സ്വാഗതം ആശംസിച്ചു. 
</p>
<p>
തുടർന്ന് നടന്ന അധ്യക്ഷ പ്രസംഗത്തിൽ യുവതീ യുവാക്കളുടെ കൂട്ടായ്മയെക്കുറിച്ചും ജില്ലയിൽ അതിൻറെ പ്രസക്തിയെക്കുറിച്ചും ജില്ലാ യുവവേദി പ്രസിഡൻറ് ശ്രീ അനൂപ് ഉണ്ണി വിശദമായി സംസാരിച്ചു. തുടർന്ന് ജില്ലാ യുവവേദി സെക്രട്ടറി ശ്രീ ദീപേഷ് ദർശൻ യുവവേദിയുടെ കഴിഞ്ഞകാല പ്രവർത്തനങ്ങളെക്കുറിച്ച് ഹ്രസ്വമായി സംസാരിച്ചു. തുടർന്ന് കേന്ദ്ര സെക്രട്ടറിയും ജില്ലാ യുവവേദിയുടെ മാർഗദർശി കൂടിയായ ശ്രീ കൃഷ്ണൻ നമ്പീശൻ മുഖ്യപ്രഭാഷണം നടത്തി. SPSS എറണാകുളം ജില്ലാ പ്രസിഡൻറ് ശ്രീ ആർ എസ് നമ്പ്യാർ,  സെക്രട്ടറി ശ്രീ നാരായണൻ വാസുദേവൻ, യുവവേദി ട്രഷറർ ശ്രീ സതീഷ്, യുവവേദി മാർഗ്ഗദർശി ശ്രീ ഗിരീഷ് എന്നിവർ ആശംസകൾ അർപ്പിച്ച് സംസാരിച്ചു.
</p>
<p>
മീറ്റിംഗിൽ സംസാരിച്ച എല്ലാവരും യുവവേദിയുടെ വരുംകാല പ്രവർത്തനങ്ങളെ കുറിച്ച് വാചാലരാവുകയും അടുത്തവർഷം എറണാകുളത്ത് നടക്കുന്ന ദേശീയ സമ്മേളനത്തിൽ യുവവേദിയുടെ ശക്തമായ സാന്നിധ്യം ഉണ്ടാകണമെന്ന് ആവശ്യപ്പെടുകയും ചെയ്തു. 
</p>
<p>
തുടർന്ന് മീറ്റിങ്ങിൽ പങ്കെടുത്ത എല്ലാവർക്കും യുവവേദിയുടെ ഭാവി പ്രവർത്തനങ്ങളെക്കുറിച്ച് ചർച്ച ചെയ്യാനുള്ള തുറന്ന അവസരം നൽകുകയുണ്ടായി. ഈ അവസരത്തിൽ സംസാരിച്ച എല്ലാവരും ഒരേ സ്വരത്തിൽ യുവവേദിയുടെ ശക്തമായ സാന്നിധ്യം ജില്ലയിൽ ഉണ്ടാകണമെന്ന് ആശ പ്രകടിപ്പിക്കുകയും ഒപ്പം തന്നെ ഏതെങ്കിലും വിധത്തിലുള്ള ആക്ടിവിറ്റികളിലൂടെ കൂടുതൽ യുവജനങ്ങളെ യുവവേദിയുടെ പ്രവർത്തനങ്ങളിൽ പങ്കാളികളാക്കണമെന്ന് ഊന്നി പറയുകയും ചെയ്തു.
</p>
<p>
നവംബർ മാസത്തോടുകൂടി ജില്ലയിലെ യുവജനങ്ങളുടെ ഒരു ഡേറ്റാ ബേസ് തയ്യാറാക്കുവാനും ഡിസംബറിൽ ഒരു ഒത്തുചേരലോ അല്ലെങ്കിൽ ഒരു ദിവസത്തെ രാത്രികാല ക്യാമ്പോ സംഘടിപ്പിക്കുവാനും തീരുമാനിച്ചു. അതുപോലെ തന്നെ അടുത്തവർഷം മാർച്ചോടുകൂടി 100 പേർ അടങ്ങുന്ന ഒരു ജില്ലാ യുവവേദി ടീം രൂപീകരിക്കുവാനും തീരുമാനിച്ചു.
</p>
<p>
ആലുവ പ്രാദേശികസഭാംഗം ശ്രീമതി കവിതയുടെ നന്ദി പ്രകാശനത്തോടു കൂടി ഏകദേശം 9.30 ന് മീറ്റിംഗ് അവസാനിച്ചു.
</p>`;

const _28dec2024 = `
<h4>യുവവേദി മീറ്റിങ് മിനിറ്റ്സ്&nbsp;&nbsp;|&nbsp;&nbsp;28 Dec 2024&nbsp;&nbsp;|&nbsp;&nbsp;08:00 PM</h4>
<p>
എറണാകുളം ജില്ലാ യുവവേദിയുടെ ഡിസംബർ മാസത്തിലെ യോഗം 28/12/2024 ശനിയാഴ്ച രാത്രി 8 PM മുതൽ 9.30 PM വരെ ഓൺലൈനായി കൂടുകയുണ്ടായി.
</p>
<p>
പെരുമ്പാവൂർ PS ലെ കുമാരി ദർശന പ്രാർത്ഥന ഗീതം ആലപിച്ചു.
</p>
<p>
പെരുമ്പാവൂർ PS ലെ കുമാരി ദേവിക കഴിഞ്ഞ കാലങ്ങളിൽ നമ്മെ വിട്ടു പിരിഞ്ഞവരോടുള്ള അനുശോചനം രേഖപ്പെടുത്തി.
</p>
<p>
പെരുമ്പാവൂർ PS ലെ കുമാരി ഗോപിക സ്വാഗതം പറഞ്ഞു യോഗം നടപടി കൾക്ക് തുടക്കമായി.
</p>
<p>
എറണാകുളം യുവ വേദി പ്രസിഡണ്ട് ശ്രീ അനൂപ് ഉണ്ണി  യോഗത്തിൽ അധ്യക്ഷത വഹിച്ചു. അദ്ദേഹത്തിന്റെ അധ്യക്ഷ പ്രസംഗത്തിൽ യുവ വേദിയുടെ പ്രാധാന്യത്തെക്കുറിച്ചും അംഗങ്ങൾ പങ്കെടുക്കേണ്ടതിന്റെ ആവശ്യത്തെപ്പറ്റിയും, വരുന്ന 3 മാസത്തിൽ യുവ വേദി നടത്തേണ്ട പരിപാടികളെ കുറിച്ച് പറയുകയുണ്ടായി. കൂടാതെ കഴിഞ്ഞ കാല പ്രവർത്തന റിപ്പോർട്ട്‌ അവതരിപ്പിച്ചു. തുടർന്ന് നടന്ന റിപ്പോർട്ടിങ്ങിൽ സഹവാസ ക്യാമ്പ് ആളുകളുടെ അപര്യാപ്തത മൂലം മാറ്റിവെച്ചതായിട്ടും ജനുവരി 12 ന് സ്വാമി വിവേകാനന്ദന്റെ ജന്മദിനമായ ദേശിയ യുവ ദിനത്തിൽ ജില്ല യുവ വേദി ഒരു യുവ സംഗമം നടത്തുവാനും സമിതി തീരുമാനിച്ചതായി അറിയിച്ചു.
</p>
<p>
എല്ലാ അംഗങ്ങളെയും ഗ്രൂപ്പിൽ ഉൾപ്പെടുത്താത്തതായി കണ്ടത് ചർച്ച ചെയ്യുകയും എത്രയും പെട്ടെന്ന് അവരെ ഗ്രൂപ്പിൽ അംഗങ്ങളാക്കാനും തീരുമാനിച്ചു
</p>
<p>
കേന്ദ്ര യുവതി ചെയർമാൻ ശ്രീആനന്ദ് കേശവൻ യോഗത്തിൽ പങ്കെടുക്കുകയും ആശംസകൾ അറിയിക്കുന്നതിനോടൊപ്പം എല്ലാ മാസവും പ്രതിമാസയോഗങ്ങൾ, പ്രാദേശിക, ജില്ല സമിതികൾ നടത്തുന്നതിന്റെ ഗുണങ്ങളെപ്പറ്റിയും വിശദമായി പറഞ്ഞു. കുറഞ്ഞപക്ഷം മൂന്നുമാസത്തെ പ്രവർത്തനങ്ങളുമായി എങ്കിലും മുന്നോട്ടു പോകണമെന്ന് നിർദ്ദേശം അദ്ദേഹത്തിൻറെ ഭാഗത്തുനിന്ന് ഉണ്ടായി.
</p>
<p>
മധ്യ മേഖല യുവ വേദി കൺവീനർ ശ്രി രഞ്ജിത്ത് വാസുദേവനും ആശംസകൾ നേർന്നു സംസാരിച്ചു.
</p>
<p>
SPSS ദേശീയ സെക്രട്ടറി ശ്രീ കൃഷ്ണൻ നമ്പിശൻ, എറണാകുളം ജില്ലാ സമിതി സെക്രട്ടറി ശ്രി നാരായണൻ വാസുദേവൻ, എറണാകുളം ജില്ല പ്രസിഡന്റ്‌  ശ്രി R S നമ്പ്യാർ എറണാകുളം ജില്ല യുവവേദി മെന്റർ ശ്രി *N G ഗിരീഷ്, ശ്രി സതീഷ് CR എന്നിവർ ആശംസ പ്രസംഗത്തിൽ കൂടുതൽ യുവതി യുവാക്കൾ ചർച്ചകളിൽ പങ്കെടുക്കണമെന്നും വരുന്ന മൂന്ന് മാസത്തെ സമിതി തീരുമാനിക്കുന്ന പരിപാടികളിൽ യുവതി യുവാക്കളുടെ കൂടുതൽ പങ്കാളിത്തം ഉണ്ടാകണമെന്നും നിർദ്ദേശിച്ചു.
</p>
<p>
യോഗത്തിൽ പങ്കെടുത്ത പ്രാദേശിക സഭകളിലെ എല്ലാ അംഗങ്ങളും അവരവരുടെ അഭിപ്രായങ്ങൾ പറയുകയുണ്ടായി
</p>
<p>
യോഗത്തിൽ കേന്ദ്ര കമ്മിറ്റി അംഗം ശ്രി മോഹന ചന്ദ്രൻ, അഭിരാജ് ബാലസുബ്രമണ്യൻ, ധനേഷ്, പ്രസാദ് P നമ്പ്യാർ, കവിത ഹരി, ശ്രീദേവി, ഗണേഷ് നാരായണൻ, ഹരീഷ് എന്നിവർ സംസാരിച്ചു 
</p>
<p>
യോഗം 9.30 ന് പെരുമ്പാവൂർ PS ലെ കുമാരി കൃഷ്ണേന്ദു ന്റെ കൃതജ്ഞതയോടെ അവസാനിച്ചു.
</p>
`;

const _26jan2025 = `
<h4>യുവവേദി മീറ്റിങ് മിനിറ്റ്സ്&nbsp;&nbsp;|&nbsp;&nbsp;26 Jan 2025&nbsp;&nbsp;|&nbsp;&nbsp;08:30 PM</h4>
<p>
എറണാകുളം ജില്ലാ യുവവേദിയുടെ ജനുവരി മാസത്തെ രണ്ടാമത്തെ എക്സിക്യൂട്ടീവ് മീറ്റിംഗ് 2025 ജനുവരി 26 ന് രാത്രി 8:30 മണിക്ക് ഓൺലൈനായി ചേരുകയുണ്ടായി.
</p>
<p>
ഈ മാസം പന്ത്രണ്ടാം തീയതി കടമറ്റത്ത് വച്ചു നടന്ന വിവേകാനന്ദം 2025 ന്റെ അവലോകനം, യുവവേദിയുടെ ഫെബ്രുവരി മാസത്തെ പ്രവർത്തനങ്ങൾ, ദേശീയ സമ്മേളനവുമായി ബന്ധപ്പെട്ട് യുവവേദി മുന്നോട്ടുവയ്ക്കുന്ന റീൽസ് മത്സരം ഇവയൊക്കെ ആയിരുന്നു ഈ മീറ്റിങ്ങിന്റെ പ്രധാന അജണ്ട.
</p>
<p>
ജില്ലാ യുവവേദി പ്രസിഡൻറ് ശ്രീ അനൂപ് ഉണ്ണി അധ്യക്ഷനായ മീറ്റിംഗ്, പെരുമ്പാവൂർ പ്രാദേശിക സഭാംഗം കുമാരി ഗോപിക സുരേഷിൻ്റെ ഈശ്വര പ്രാർത്ഥനയോടെ തുടങ്ങി. തുടർന്ന്  യുവവേദി പ്രസിഡൻറ്, വിവേകാനന്ദം 2025 പൂർണമായി അവലോകനം ചെയ്യുകയുണ്ടായി. പരിപാടിയുടെ ഗുണങ്ങൾ എടുത്തു പറയുകയും ഒന്നുകൂടി ശ്രമിക്കുകയാണെങ്കിൽ അടുത്ത പരിപാടി ഇതിനേക്കാൾ നമുക്ക് നന്നാക്കുവാൻ സാധിക്കും എന്നും അഭിപ്രായപ്പെട്ടു.  വിവേകാനന്ദം 2025 പങ്കെടുത്ത മറ്റ് എക്സിക്യൂട്ടീവ് അംഗങ്ങളും അവരുടെ അനുഭവങ്ങൾ പങ്കുവെച്ചു.
</p>
<p>
ജില്ലാ യുവവേദി ട്രഷറർ ശ്രീ സതീഷ് വിവേകാനന്ദം 2025 ന്റെ വരവ് ചിലവ് കണക്കുകൾ അവതരിപ്പിച്ചു.
</p>
<p>
പിന്നീട് സംസാരിച്ച യുവവേദി മാർഗ്ഗദർശിയും ജില്ലയിൽ നിന്നുള്ള കേന്ദ്ര സെക്രട്ടറിയും കൂടിയായ ശ്രീ കൃഷ്ണൻ നമ്പീശൻ വിവേകാനന്ദം 2025 നെ കുറിച്ച്  സംസാരിക്കുകയും പങ്കെടുത്ത എല്ലാവരെയും അഭിനന്ദിക്കുകയും ചെയ്തു. വരവ് ചിലവ് കണക്കുകൾ കൃത്യമായി സൂക്ഷിക്കുവാനും വിവേകാനന്ദം 2025 പരിപാടിയുടെ ബാലൻസ് എമൗണ്ട് തൽക്കാലം ട്രഷററുടെ കയ്യിൽ തന്നെ സൂക്ഷിക്കുവാനും അദ്ദേഹം അഭിപ്രായപ്പെട്ടു.
</p>
<p>
SPSS സംഘടിപ്പിക്കുന്ന ക്രിക്കറ്റ് ലീഗിനു മുന്നോടിയായി ജില്ലയ്ക്ക് അകത്ത് സൗഹൃദ മത്സരങ്ങൾ സംഘടിപ്പിക്കുവാനും അതുവഴി കൂടുതൽ യുവാക്കളെ സംഘടനയിലേക്ക് ആകർഷിക്കുവാനും തീരുമാനിച്ചു.  ജില്ലാ യുവവേദി രക്ഷാധികാരി കൂടിയായ ശ്രീ ഗിരീഷ്. എൻ. ജി അതിലേക്കായി അദ്ദേഹത്തിൻ്റെ നിർദ്ദേശങ്ങൾ പങ്കുവെച്ചു.
</p>
<p>
തുടർന്ന് ജില്ലാ സെക്രട്ടറി ശ്രീ നാരായണൻ വാസുദേവൻ, ദേശീയ സമ്മേളനത്തിന് പേര് നിർദ്ദേശിക്കുവാൻ വേണ്ടിയുള്ള റീൽസ് മത്സരത്തെക്കുറിച്ച് കുറിച്ച് മീറ്റിംഗിൽ വിശദമായി സംസാരിച്ചു. ഈ മത്സരം അനൗൺസ് ചെയ്യുന്നതു മുതലുള്ള എല്ലാ പ്രവർത്തനങ്ങളും യുവവേദി ഏറ്റെടുത്ത് നടത്തേണ്ടതാണ് എന്ന് പറഞ്ഞു. മത്സരത്തിൻ്റെ മാർഗ്ഗനിർദ്ദേശങ്ങൾ കൂടി ചേർത്ത് എത്രയും പെട്ടെന്ന് മത്സരം അനൗൺസ് ചെയ്യുവാൻ യുവവേദിയോട് ആവശ്യപ്പെട്ടു. സമ്മേളനത്തിന്റെ ഭാഗമായി ഒരു പുതിയ ഇമെയിൽ അഡ്രസ് ഉണ്ടാക്കുവാനുള്ള ചുമതല യുവവേദിയെ ഏൽപ്പിച്ചു.
</p>
<p>
ജില്ലാ യുവവേദി പ്രസിഡൻറ് ശ്രീ അനൂപ് ഉണ്ണിയുടെ നന്ദി പ്രകാശനത്തോടെ 10 മണിക്ക് മീറ്റിംഗ് സമാപിച്ചു.
</p>
`;


const minutesMap = {
    _09nov2024: _09nov2024,
    _28dec2024: _28dec2024,
    _26jan2025: _26jan2025
};

function onMinituesItemClick(item) {
    const content = minutesMap[item.id];
    if (content) {
        document.getElementById("minitues-content").innerHTML = content;
        document.getElementById("minitues-content").scrollIntoView();
    }
}